{"title":"Can Data Die?","subtitle":"Why One of the Internet’s Oldest Images Lives On Without Its Subject’s Consent","url":"https://pudding.cool/2021/10/lenna","bylines":[{"author":"Jennifer Ding","url":"https://pudding.cool/author/jennifer-ding/"},{"author":"Jan Diehm","url":"https://pudding.cool/author/jan-diehm/"},{"author":"Michelle McGhee","url":"https://pudding.cool/author/michelle-mcghee/"}],"scrollProse":[{"text":"In 2021, sharing content is easier than ever. Our lingua franca is visual: memes, infographics, TikToks. Our references cross borders and platforms, shared and remixed a hundred different ways in minutes. Digital culture is collective by default and has us 😂, 😭, and 😍 together all around the world."},{"text":"But as the internet reaches its “dirty 30s,” what happens when pieces of digital culture that have been saved, screenshotted, and reposted for years need to retire? Let’s dig into the story of one of these artifacts: <span class=bolded>The Lenna image</span>."},{"text":"The Lenna image may be relatively unknown in pop culture today, but in the engineering world, it remains an icon. I first encountered the image in an undergrad class, then grad school, and then all over the sites and software I use every day as a tech worker like <a href=https://github.com/mikolalysenko/lena>Github</a>, <a href=https://docs.opencv.org/4.5.3/dc/dd3/tutorial_gausian_median_blur_bilateral_filter.html>OpenCV</a>, <a href=https://stackoverflow.com/questions/56346850/set-image-inside-png-transparency>Stack Overflow</a>, and <a href=https://www.quora.com/topic/Image-Processing>Quora</a>."},{"text":"<span class=bolded>This is Lenna.</span>"},{"text":"To understand where the image is today, you have to understand how it got here. So, I decided to scrape Google scholar, search, and reverse image search results to track down thousands of instances of the image across the internet (see more in the <a href=#methods>methods section</a>)."},{"text":"Lena Forsén, the real human behind the Lenna image, was <a href=https://www.iplayboy.com/issue/19721101>first published in Playboy</a> in <span>1972</span>. Soon after, USC engineers searching for a suitable test image for their image processing research sought inspiration from the magazine. They deemed Lenna the right fit and scanned the image into digital, <a href=https://www.pcmag.com/encyclopedia/term/rgb>RGB</a> existence.","image":"playboy"},{"text":"From here, the story of the image follows the story of the internet. Lenna was one of the first inhabitants of ARPANet, the internet’s predecessor, and then the world wide web."},{"text":"While the image’s reach was limited to a few research papers in the ’70s and ’80s, in <span>1991</span>, Lenna was featured on the cover of an <a href=https://www.spiedigitallibrary.org/journals/optical-engineering/volume-30/issue-07>engineering journal</a> alongside another popular test image, <a href=https://www.researchgate.net/figure/Original-standard-test-image-of-Peppers_fig8_259521525>Peppers</a>.","image":"journal"},{"text":"This caught the attention of Playboy, which threatened a copyright infringement lawsuit. Engineers who had grown attached to Lenna fought back. Ultimately, they prevailed, and as a Playboy VP <a href=https://www.wired.com/1997/05/playmate-meets-geeks-who-made-her-a-net-star/>reflected on the drama</a>: \"We decided we should exploit this because it is a phenomenon.\""},{"text":"The Playboy controversy canonized Lenna in engineering folklore and prompted an explosion of conversation about the image. Image hits on the internet rose to a peak number in <span>1995</span>."},{"text":"In the 21st century, the image has remained a common sight in classrooms and on TV, including a feature on <a href=https://www.hbo.com/silicon-valley>Silicon Valley</a> in <span>2014</span>.","image":"silicon-valley"},{"text":"Pushback towards the use of the image also grew in the 2010s leading up to <span>2019</span>, when the <a href=https://www.losinglena.com/>Losing Lena</a> documentary was released."},{"text":"Forsén shares her side of the story and asks for her image to be retired: “I retired from modelling a long time ago. It’s time I retired from tech, too. We can make a simple change today that creates a lasting change for tomorrow. Let’s commit to losing me.”","image":"losing-lena"},{"text":"After the film’s release, many of my female colleagues shared stories about their own encounters with the image throughout their careers. When one of the only women this well referenced, respected, and remembered in your field is known for a nude photo that was taken of her and is now used without her consent, it inevitably shapes the perception of the position of women in tech and the value of our contributions."},{"text":"The film called on the engineering community to stop their spread of the image and use alternatives instead. This led to efforts to remove the image from textbooks and production code and a slow, but noticeable decline in the image’s use for research."},{"text":"But despite this progress, almost 2 years later, the use of Lenna continues. The image appears on the internet in 30+ different languages in the last decade, including 10+ languages in <span>2021</span>."},{"text":"The image’s spread across digital geographies has mirrored this geographical growth, moving from mostly <span class=org-span>.org</span> domains before 1990 to over 100 different domains today, notably <span class=com-span>.com</span> and <span class=edu-span>.edu</span>, along with <span class=other-span>others</span>."},{"text":"Within the <span class=edu-span>.edu</span> world, the Lenna image continues to appear in <a href=https://www.cis.rit.edu/class/simg782/homework/Homework_1/pgm_ex13.html>homework questions</a>, <a href=http://www.cs.cornell.edu/courses/cs1109/2013su/lecs/lec11.pdf>class slides</a> and to be hosted on <a href=https://www.ece.rice.edu/~wakin/images/>educational and research sites</a>, ensuring that it is passed down to new generations of engineers. Whether it's due to institutional negligence or defiance, it seems that for now, the image is here to stay."}],"postProse":[{"type":"text","value":"Having known Lenna for almost a decade, I have struggled to understand what the story of the image means for what tech culture is and what it is becoming."},{"type":"text","value":"To me, the crux of the Lenna story is how little power we have over our data and how it is used and abused. This threat seems disproportionately higher for women who are often overrepresented in internet content, but <a href=https://www.theverge.com/2021/7/2/22560628/google-diversity-report-departures-black-women>underrepresented</a> <a href=https://www.protocol.com/twitter-pay-equity>in</a> <a href=https://www.theverge.com/2021/4/29/22409753/snap-diversity-report-numbers-inclusive-camera>internet</a> <a href=https://www.theverge.com/2020/12/1/21755406/pinterest-shareholders-lawsuit-sue-toxic-work-culture-discrimination>company</a> <a href=https://www.usatoday.com/story/tech/2020/07/15/facebook-diversity-african-american-black-hispanic-latino-employees/5430124002/>leadership</a> and decision making. Given this reality, engineering and product decisions will continue to consciously (and unconsciously) exclude our needs and concerns."},{"type":"text","value":"While social norms are changing towards non-consensual data collection and data exploitation, digital norms seem to be moving in the opposite direction. Advancements in machine learning algorithms and data storage capabilities are only making data misuse easier. Whether the outcome is revenge porn or targeted ads, surveillance or discriminatory AI, if we want a world where our data can retire when it's outlived its time, or when it's directly harming our lives, we must create the tools and policies that empower data subjects to have a say in what happens to their data… including allowing their data to die."}],"readingHeader":"Further Reading","readingLists":[{"header":"On the Lenna image","links":[{"type":"text","value":"<a href=https://mitpress.mit.edu/books/proxies>“Proxies: The Cultural Work of Standing In,”</a> Dylan Mulvin"},{"type":"text","value":"<a href=https://www.wired.com/story/finding-lena-the-patron-saint-of-jpegs/>Finding Lena, The Patron Saint of JPEGs</a>, Linda Kintsler, Wired"},{"type":"text","value":"<a href=https://www.spiedigitallibrary.org/journals/optical-engineering/volume-57/issue-12/120101/Farewell-Lena/10.1117/1.OE.57.12.120101.full?SSO=1>Farewell, Lena</a>, Michael T. Eismann, Optical Engineering"}]},{"header":"On data exploitation","links":[{"type":"text","value":"<a href=https://www.thecut.com/article/emily-ratajkowski-owning-my-image-essay.html>Buying Myself Back: When does a model own her own image?</a>, Emily Ratajkowski, The Cut"},{"type":"text","value":"<a href=https://www.washingtonpost.com/technology/2020/10/20/deep-fake-nudes/>A shadowy AI service has transformed thousands of women’s photos into fake nudes: ‘Make fantasy a reality,’</a> Drew Harwell, The Washington Post"},{"type":"text","value":"<a href=https://www.eff.org/deeplinks/2020/01/clearview-ai-yet-another-example-why-we-need-ban-law-enforcement-use-face>Clearview AI—Yet Another Example of Why We Need A Ban on Law Enforcement Use of Face Recognition Now</a>, Jennifer Lynch, The Electronic Frontier Foundation"}]},{"header":"On data rights","links":[{"type":"text","value":"California’s <a href=https://oag.ca.gov/privacy/ccpa>Right to Delete</a> (CCPA) and the EU’s <a href=https://gdpr.eu/right-to-be-forgotten/>Right to Be Forgotten</a> (GDPR)"},{"type":"text","value":"<a href=https://www.penguinrandomhouse.com/books/565026/habeas-data-by-cyrus-farivar/>”Habeas Data: Privacy vs. the Rise of Surveillance Tech,”</a> Cyrus Farivar"},{"type":"text","value":"<a href=https://www.publicaffairsbooks.com/titles/shoshana-zuboff/the-age-of-surveillance-capitalism/9781610395694/>”The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power,”</a> Shoshana Zuboff"}]}],"methods":[{"type":"text","value":"To build our dataset of instances of Lenna on the internet, I used three sources: Google <a href=https://scholar.google.com/>scholar</a>, <a href=https://www.google.com/>search</a>, and <a href=https://www.google.com/imghp?hl=en>reverse image search</a>, which respectively returned 5300, 1100, and 720 results. For the two text-based search engines (Google scholar and search), I used combinations of keywords, variations on \"lenna+jpg\"+OR+\"lenna+jpeg\" or “lenna+computer+vision” to scrape hits that matched those queries. For Google scholar, I used different time intervals from 1970-2021, usually in 5 year chunks, to pull data. For Google search, I performed a manual check on the results, to filter out irrelevant pages from the dataset. In order to identify variations of the Lenna image, I used four different base images for the Google Reverse image search: the standard image, wider cropped image, grayscale image, and a flipped grayscale image. In all cases I only pulled data up to the first 100 pages of results. Data was pulled for dates through September 2021."},{"type":"text","value":"Next, I aggregated the three resulting datasets into a combined dataset and extracted the title, dates, and url/domain information from each hit (e.g. domain endings like .com and .edu). After the data was cleaned and processed, it was loaded into Google Sheets to identify the language of the title and description using the DETECTLANGUAGE function, which draws from Google Translate."},{"type":"text","value":"The data and code can be found in this <a href=https://github.com/the-pudding/lenna-data>repo</a>. To make sure we weren't contributing to the spread of the Lenna image, the full resolution image is not hosted on this site. When it appears in the article, it's either a pixelated or a blurred version."}]}