{"title":"Can Data Die?","subtitle":"Why One of the Internet’s Oldest Images Lives On Without Its Subject’s Consent","url":"https://pudding.cool/2021/10/lenna","bylines":[{"author":"Jennifer Ding","url":"https://pudding.cool/author/jennifer-ding/"},{"author":"Jan Diehm","url":"https://pudding.cool/author/jan-diehm/"},{"author":"Michelle McGhee","url":"https://pudding.cool/author/michelle-mcghee/"}],"scrollProse":[{"text":"In 2021, sharing content is easier than ever. Our lingua franca is visual: memes, infographics, TikToks. Our references cross borders and platforms, shared and remixed a hundred different ways in minutes. Digital culture is collective by default and has us 😂, 😭, and 😍 together all around the world."},{"text":"But as the Internet reaches its Dirty Thirties, what happens when pieces of digital culture that have been saved, screenshotted, and reposted for years need to retire? Let’s dig into the story of one of these artifacts."},{"text":"The Lenna image may be relatively unknown in pop culture today, but in the engineering world, it remains an icon. I first encountered the image in an undergrad class, then grad school, and then all over the sites and software I use every day as a tech worker like <a href=https://github.com/mikolalysenko/lena target=_blank>Github</a>, <a href=https://docs.opencv.org/4.5.3/dc/dd3/tutorial_gausian_median_blur_bilateral_filter.html target=_blank>OpenCV</a>, <a href=https://stackoverflow.com/questions/56346850/set-image-inside-png-transparency target=_blank>Stack Overflow</a>, and <a href=https://www.quora.com/topic/Image-Processing target=_blank>Quora</a>."},{"text":"This is Lenna. </br> </br> To understand where she is today, you have to understand how she got here."},{"text":"Lenna was <a href=https://www.iplayboy.com/issue/19721101 target=_blank>first published in Playboy</a> in <span>1972</span>. Soon after, USC engineers searching for a suitable test image for their research sought inspiration from a Playbook magazine. They deemed Lenna the right fit and scanned the image into RGB existence. From here, the story of the image follows the story of the Internet. Lenna was one of the first inhabitants of ARPANet, the Internet’s predecessor, and then the world wide web.","image":"playboy"},{"text":"While the image’s reach was limited to a few research papers in the 70s and 80s, in <span>1991</span>, Lenna was featured on the cover of an <a href=https://www.spiedigitallibrary.org/journals/optical-engineering/volume-30/issue-07 target=_blank>engineering journal</a> alongside another popular test image, <a href=https://www.researchgate.net/figure/Original-standard-test-image-of-Peppers_fig8_259521525 target=_blank>Peppers</a>.","image":"journal"},{"text":"This caught the attention of Playboy, which threatened a copyright infringement lawsuit. Engineers who had grown attached to Lenna fought back. Ultimately, they prevailed, and as a Playboy VP <a href=https://www.wired.com/1997/05/playmate-meets-geeks-who-made-her-a-net-star/ target=_blank>reflected on the drama</a>: \"We decided we should exploit this because it is a phenomenon.\""},{"text":"The Playboy controversy canonized Lenna in engineering folklore and prompted an explosion of the image’s presence on the Internet, rising to a peak number of instances in <span>1995</span>."},{"text":"In the 21st century, the image has remained a common sight in classrooms and on TV, including a feature on <a href=https://www.hbo.com/silicon-valley target=_blank>Silicon Valley</a> in <span>2014</span>.","image":"silicon-valley"},{"text":"Pushback towards the use of the image also grew in the 2010s leading up to <span>2019</span>, when the <a href=https://www.losinglena.com/ target=_blank>Losing Lena</a> documentary was released. In this film, Lena Forsén, the real human behind the Lenna image, shares her side of the story and asks for her image to be retired. The film calls on the engineering community to stop their spread of the image and use alternatives instead. In the process, it also sparked increasing attention to the female engineer experience. This led to efforts to remove the image from production code and a slow, but noticeable decline in the image’s use in research.","image":"losing-lena"},{"text":"But despite this progress, the use of Lenna continues today. The image appears on the Internet in 30+ different languages in the last decade, including 10+ languages in <span>2021</span>."},{"text":"The image’s spread across digital geographies has mirrored this geographical growth, moving from mostly <span class=org-span>.org</span> domains before 1990 to over 100 different domains today, notably <span class=com-span>.com</span> and <span class=edu-span>.edu</span>, along with <span class=other-span>others</span>."},{"text":"Within the <span class=edu-span>.edu</span> world, the Lenna image continues to appear in <a href=http://web.cse.ohio-state.edu/~stiff.4/cse3521/image-convolutions-transformations.html target=_blank>homework questions</a>, <a href=http://www.cs.cornell.edu/courses/cs1109/2013su/lecs/lec11.pdf target=_blank>class slides</a>, and <a href=https://people.sc.fsu.edu/~jburkardt/data/png/png.html target=_blank>educational and research databases</a>, ensuring that it is passed down to new generations of engineers. Whether it's due to institutional negligence or defiance, it seems that for now, the image is here to stay."}],"postProse":[{"type":"text","value":"Having known Lenna for almost a decade, I have struggled to understand what the story of the image means for what tech culture is and what it is becoming. Many of my female colleagues have personal stories to share about their encounters with the image throughout their careers. When one of the only women this well referenced, respected, and remembered in your field is known for a nude photo that was taken of her and is now used without her consent, it inevitably shapes the perception of the position of women in tech and the value of our contributions."},{"type":"text","value":"To me, the crux of the Lenna story is how little power we have over our data and how it is used and abused. This threat seems disproportionately higher for women who are often overrepresented in Internet content, but <a href=https://www.theverge.com/2021/7/2/22560628/google-diversity-report-departures-black-women target=_blank>underrepresented</a> <a href=https://www.protocol.com/twitter-pay-equity target=_blank>in</a> <a href=https://www.theverge.com/2021/4/29/22409753/snap-diversity-report-numbers-inclusive-camera target=_blank>Internet</a> <a href=https://www.theverge.com/2020/12/1/21755406/pinterest-shareholders-lawsuit-sue-toxic-work-culture-discrimination target=_blank>company</a> <a href=https://www.usatoday.com/story/tech/2020/07/15/facebook-diversity-african-american-black-hispanic-latino-employees/5430124002/ target=_blank>leadership</a> and decision making. Given this reality, engineering and product decisions will continue to consciously (and unconsciously) exclude our needs and concerns."},{"type":"text","value":"While social norms are changing towards non-consensual data collection and data exploitation, digital norms seem to be moving in the opposite direction. Advancements in machine learning algorithms and data storage capabilities are only making data misuse easier. Whether the outcome is revenge porn or targeted ads, surveillance or discriminatory AI, if we want a world where our data can retire when it's outlived its time, or when it's directly harming our lives, we must create the tools and policies that empower data subjects to have a say in what happens to their data… including allowing their data to die."}],"readingHeader":"Further Reading","readingLists":[{"header":"On the Lenna image","links":[{"type":"text","value":"<a href=https://mitpress.mit.edu/books/proxies target=_blank>“Proxies: The Cultural Work of Standing In,”</a> Dylan Mulvin"},{"type":"text","value":"<a href=https://www.wired.com/story/finding-lena-the-patron-saint-of-jpegs/  target=_blank>Finding Lena, The Patron Saint of JPEGs</a>, Linda Kintsler, Wired"},{"type":"text","value":"<a href=https://www.spiedigitallibrary.org/journals/optical-engineering/volume-57/issue-12/120101/Farewell-Lena/10.1117/1.OE.57.12.120101.full?SSO=1 target=_blank>Farewell, Lena</a>, Michael T. Eismann, Optical Engineering"}]},{"header":"On data exploitation","links":[{"type":"text","value":"<a href=https://www.thecut.com/article/emily-ratajkowski-owning-my-image-essay.html target=_blank>Buying Myself Back: When does a model own her own image?</a>, Emily Ratajkowski, The Cut"},{"type":"text","value":"<a href=https://www.washingtonpost.com/technology/2020/10/20/deep-fake-nudes/  target=_blank>A shadowy AI service has transformed thousands of women’s photos into fake nudes: ‘Make fantasy a reality,’</a> Drew Harwell, The Washington Post"},{"type":"text","value":"<a href=https://www.spiedigitallibrary.org/journals/optical-engineering/volume-57/issue-12/120101/Farewell-Lena/10.1117/1.OE.57.12.120101.full?SSO=1 target=_blank>Clearview AI—Yet Another Example of Why We Need A Ban on Law Enforcement Use of Face Recognition Now</a>, Jennifer Lynch, The Electronic Frontier Foundation"}]},{"header":"On data rights","links":[{"type":"text","value":"California’s <a href=https://oag.ca.gov/privacy/ccpa target=_blank>Right to Delete</a> (CCPA) and the EU’s <a href=https://gdpr.eu/right-to-be-forgotten/ target=_blank>Right to Be Forgotten</a> (GDPR)"},{"type":"text","value":"<a href=https://www.penguinrandomhouse.com/books/565026/habeas-data-by-cyrus-farivar/ target=_blank>”Habeas Data: Privacy vs. the Rise of Surveillance Tech,”</a> Cyrus Farivar"},{"type":"text","value":"<a href=https://www.publicaffairsbooks.com/titles/shoshana-zuboff/the-age-of-surveillance-capitalism/9781610395694/ target=_blank>”The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power,”</a> Shoshana Zuboff"}]}],"methods":[{"type":"text","value":"Vestibulum ullamcorper metus quis imperdiet feugiat. Maecenas non dolor nibh. Aliquam erat volutpat. Pellentesque iaculis sapien sit amet faucibus placerat. Vivamus vel congue ipsum. Duis at vulputate nulla, eget convallis eros. Sed et mi faucibus libero iaculis tempor. Nulla a eros sed nunc porttitor gravida. Ut fermentum orci ac tellus ultrices, eget viverra metus dictum. Donec erat justo, aliquam in porttitor at, pretium non est. Donec sed felis tempor, luctus elit quis, consectetur nisi. Etiam elit ipsum, porttitor in mi eget, auctor tempor orci. Suspendisse sodales nisl sit amet turpis consectetur posuere. Aenean dui elit, finibus ac hendrerit in, pellentesque sed purus. Vivamus elementum congue velit, vel venenatis erat tempus vel. Integer congue enim mi, sit amet tempor justo lacinia in."},{"type":"text","value":"In faucibus erat vel dolor venenatis venenatis. Aliquam finibus neque neque, ac dictum lorem auctor quis. Aenean eu gravida mi. Sed luctus, turpis at placerat egestas, ligula lacus varius diam, lacinia efficitur orci elit vel tellus. Nam tincidunt aliquam purus quis pellentesque. In aliquam commodo tortor. Etiam vehicula tincidunt elit eget tristique."}]}