{"title":"Can Data Die?","subtitle":"Why the Internet’s Oldest Image Lives On Without Its Subject’s Consent","url":"https://pudding.cool/2021/10/lenna","bylines":[{"author":"Jennifer Ding","url":"https://pudding.cool/author/jennifer-ding/"},{"author":"Jan Diehm","url":"https://pudding.cool/author/jan-diehm/"},{"author":"Michelle McGhee","url":"https://pudding.cool/author/michelle-mcghee/"}],"scrollProse":[{"type":"text","value":"In 2021, sharing content is easier than ever. Our lingua franca is visual: memes, infographics, TikToks. Our references cross borders and platforms, shared and remixed a hundred different ways in minutes. Digital culture is collective by default and has us 😂, 😭, and 😍 together all around the world."},{"type":"text","value":"But as the Internet reaches its Dirty Thirties, what happens when pieces of digital culture that have been saved, screenshotted, and reposted for years need to retire? Let’s dig into the story of one of these artifacts."},{"type":"text","value":"This is Lenna."},{"type":"text","value":"While it may be relatively unknown in pop culture today, in the engineering world, Lenna remains an icon. I first encountered the image in an undergrad class, then grad school, and then all over the sites and software I use every day as a tech worker like NPM, OpenCV, Stack Overflow, Quora, and Github."},{"type":"text","value":"To understand where Lenna is today, you have to understand how she got here."},{"type":"text","value":"(1970s-1980s) Lenna was first published in Playboy in 1972. Soon after, engineers at USC’s Image Processing lab looking for a suitable test image for their research sought inspiration from a Playboy centerfold. They deemed Lenna the right fit and scanned the image into RGB existence. From here, the story of the image is roughly the story of the Internet. Lenna was one of the first inhabitants of ARPANet, the Internet’s predecessor, and then the world wide web."},{"type":"text","value":"(1990s) While the image’s reach was limited to a few research papers in the 70s and 80s, controversy propelled Lenna back to front pages in 1991 after it was featured on the cover of an engineering journal. This caught the attention of Playboy, which threatened a copyright infringement lawsuit. Engineers who had grown attached to Lenna fought back. Ultimately, they prevailed, and as a Playboy VP reflected on the drama: \"We decided we should exploit this, because it is a phenomenon.\""},{"type":"text","value":"(2000s-2010s) After this viral moment, the Lenna image began to spread around the world. In the 21st century, the image remains a common sight in classrooms and on TV, including a feature on Silicon Valley in 2014. However, pushback towards the use of the image also grew in the 2010s leading up to 2019, when the Losing Lena documentary was released. In this film, Lena Forsén, the real human behind the Lenna image, shares her side of the story and asks for her infamous image to be retired. The film calls on organizations to stop their spread of the image and use alternatives instead."},{"type":"text","value":"This moment of industry-wide reckoning revealed how the Lenna image has impacted so many women in tech. My classmates, research advisors, and even the CEO of my company, whose daughter participated in the Losing Lena documentary, all had personal stories to share about their own encounters with the image. When one of the only women this well referenced, respected, and remembered in your field is known for a nude photo that was taken of her and used without her consent, it inevitably shapes the perception of the value of women in tech and our contributions to the field."},{"type":"text","value":"The film sparked increasing attention to the female experience in tech and a shift in attitudes towards the use of the image. One of the remaining avenues to encourage its disuse seems to be the Playboy copyright. Using this threat, along with ethical concerns, as justification for removing the image from classrooms and production code has led to mixed results and a slow, but noticeable decline in the use of the image for research."},{"type":"text","value":"Despite all this, today the use of Lenna is alive and well. Whether it's due to institutional negligence or defiance, it seems that for now, the image is here to stay."},{"type":"text","value":"Today, the image appears in articles, textbooks, and research papers in 32 different languages.  Its spread across digital geographies mirrors this growth, moving from mostly .org domains before 1990 to almost 100 different domains today, notably .com and .edu. Within the .edu world, the Lenna image continues to appear in research papers, homework questions, and class slides, ensuring that it is passed down to new generations of engineers."},{"type":"text","value":"----------"},{"type":"text","value":"Ending 2: Quantifying disproportionate impact of data harms on women"},{"type":"text","value":"To me, the crux of the Lenna story is that we have so little power over our data and how it can be used and abused. This is disproportionately true for women, who are ___% of data on these platforms and ___% of leadership on these teams. While it’s largely female content that powers these platforms, it’s largely male teams who are controlling and profiting from that content. Whether it’s the engineering team or the C-Suite, with gender ratios like this, product and business strategy decisions will consciously (and subconsciously) preclude female concerns and needs. (Examples: GANs porn, Clearview to search women)"},{"type":"text","value":"Ending 1: Data Death"},{"type":"text","value":"This raises the question of whether or not digital data like Lenna can ever disappear? Once something is on the Internet, is it too late? What power can \"data consent\" hold, when it's so easy for anyone to save data to digital eternity?"},{"type":"text","value":"To me, the crux of the Lenna story is that we have so little power over our data, who collects it, and how it can be used/abused. While our social norms are changing towards personal data collection, particularly if it’s gathered without consent, our digital norms seem harder to change. Advancements in algorithms and data storage capabilities are only making data abuse easier."},{"type":"text","value":"Whether the outcome is revenge porn or targeted ads, surveillance or discriminatory AI, if we want a world where our data can retire when it's outlived its time, or when it's directly harming our lives, we must build the tools and systems that allow data subjects to have a say in what happens to data about them."},{"type":"text","value":"Here are some possibilities..."},{"type":"text","value":"* Identify the image in a software build and exclude its use"},{"type":"text","value":"* Hosting a standard pixelated or distorted version of the image, which can serve as an example or proxy for the actual image but will discourage use of the original"},{"type":"text","value":"* Warning message that pops up whenever the image is uploaded to a storage site like Github or social media site like Twitter"},{"type":"text","value":"* Swap out image uses in text books and class slides with alternative test images"},{"type":"text","value":"* Email bot that messages professors hosting the image on their personal websites and suggests another"}],"post-prose":[],"methods":[]}