{"title":"Can Data Die?","subtitle":"Why the One of the Internet’s Oldest Image Lives On Without Its Subject’s Consent","url":"https://pudding.cool/2021/10/lenna","bylines":[{"author":"Jennifer Ding","url":"https://pudding.cool/author/jennifer-ding/"},{"author":"Jan Diehm","url":"https://pudding.cool/author/jan-diehm/"},{"author":"Michelle McGhee","url":"https://pudding.cool/author/michelle-mcghee/"}],"scrollProse":[{"type":"text","value":"In 2021, sharing content is easier than ever. Our lingua franca is visual: memes, infographics, TikToks. Our references cross borders and platforms, shared and remixed a hundred different ways in minutes. Digital culture is collective by default and has us 😂, 😭, and 😍 together around the world."},{"type":"text","value":"But as the Internet reaches its Dirty Thirties, what happens when pieces of digital culture that have been saved, screenshotted, and reposted for years need to retire? Let’s dig into the story of one of these artifacts."},{"type":"text","value":"The Lenna image may be relatively unknown in pop culture today, but in the engineering world, she remains an icon. I first encountered Lenna in an undergrad class, and then in grad school, in Silicon Valley, and all over the sites and software I use every day as a tech worker like NPM, OpenCV, Stack Overflow, Github."},{"type":"text","value":"This is Lenna."},{"type":"text","value":"To understand where Lenna is today, you’ve got to understand how she got here."},{"type":"text","value":"Lenna was first published in Playboy in 1972. Soon after, engineers at USC’s Image Processing lab looking for a suitable test image for their research sought inspiration from a Playboy centerfold in the lab. They deemed the Lenna image the right fit and scanned it into RGB existence."},{"type":"text","value":"From here, the story of the image is roughly the story of the Internet. Lenna was one of the first inhabitants of ARPANet, the Internet’s predecessor, and then the world wide web."},{"type":"text","value":"While the image’s reach was limited to a few research papers in the 70s and 80s, controversy propelled Lenna back to front pages in 1991. After it was featured on the cover of an engineering journal, it caught the attention of Playboy who threatened a lawsuit over copyright infringement. Engineers who had grown attached to Lenna, fought back. Ultimately, the engineers prevailed, and as a Playboy VP reflected on the drama: \"We decided we should exploit this, because it is a phenomenon.\""},{"type":"text","value":"In the years following, the Lenna image spread around the world, appearing in research papers, blogs, and tutorials in 32 different languages."},{"type":"text","value":"Its spread across digital geographies mirrored this growth, moving from mostly .org domains before 1990 to almost 100 different domains today, notably .com and .edu."}],"post-prose":[],"methods":[]}