{"title":"Can Data Die?","subtitle":"Why the Internet’s Oldest Images Lives On Without Its Subject’s Consent","url":"https://pudding.cool/2021/10/lenna","bylines":[{"author":"Jennifer Ding","url":"https://pudding.cool/author/jennifer-ding/"},{"author":"Jan Diehm","url":"https://pudding.cool/author/jan-diehm/"},{"author":"Michelle McGhee","url":"https://pudding.cool/author/michelle-mcghee/"}],"scrollProse":[{"type":"text","value":"In 2021, sharing content is easier than ever. Our lingua franca is visual: memes, infographics, TikToks. Our references cross borders and platforms, shared and remixed a hundred different ways in minutes. Digital culture is collective by default and has us 😂, 😭, and 😍 together all around the world."},{"type":"text","value":"But as the Internet reaches its Dirty Thirties, what happens when pieces of digital culture that have been saved, screenshotted, and reposted for years need to retire? Let’s dig into the story of one of these artifacts."},{"type":"text","value":"The Lenna image may be relatively unknown in pop culture today, but in the engineering world, Lenna remains an icon. I first encountered the image in an undergrad class, then grad school, Silicon Valley, and all over the sites and software I use every day as a tech worker like NPM, OpenCV, Stack Overflow, and Github."},{"type":"text","value":"This is Lenna."},{"type":"text","value":"To understand where Lenna is today, you’ve got to understand how she got here."},{"type":"text","value":"Lenna was first published in Playboy in 1972. Soon after, engineers at USC’s Image Processing lab looking for a suitable test image for their research sought inspiration from a Playboy centerfold in the lab. They deemed the Lenna image the right fit and scanned it into RGB existence."},{"type":"text","value":"From here, the story of the image is roughly the story of the Internet. Lenna was one of the first inhabitants of ARPANet, the Internet’s predecessor, and then the world wide web."},{"type":"text","value":"While the image’s reach was limited to a few research papers in the 70s/80s, controversy propelled Lenna back to front pages in 1991. After the image was featured on the cover of an engineering journal, it caught the attention of Playboy which threatened a lawsuit over copyright infringement. Engineers who had grown attached to Lenna, fought back. Ultimately, the engineers prevailed, and as a Playboy VP reflected on the drama: \"We decided we should exploit this, because it is a phenomenon.\""},{"type":"text","value":"After this viral moment, the Lenna image began to spread around the world, appearing in articles, tutorials, and research papers in 32 different languages."},{"type":"text","value":"Its spread across digital geographies mirrored this growth, moving from mostly .org domains before 1990 to almost 100 different domains today, notably .com and .edu."},{"type":"text","value":"Within the .edu world, the Lenna image continues to appear in research papers, homework questions, and class slides, ensuring that it is passed down to new generations of engineers."},{"type":"text","value":"In 2019, Lena Forsén, the real human behind the image, worked with Creatable and Code Like a Girl to release Losing Lena, a documentary calling for the use of her image to retire. The campaign called on organizations to stop their spread of the image and use alternative images instead."},{"type":"text","value":"This moment of industry-wide reckoning revealed how deeply the Lenna image has impacted women in the engineering community: my classmates, research advisors, and even the CEO of my company, whose daughter participated in the documentary, spoke up. We shared stories of our first encounters with the image in educational or professional settings, often the lone voices questioning the use of the image among male peers who had very different reactions."},{"type":"text","value":"The film sparked increasing attention to the female engineer experience and a shift in attitudes towards the use of the image [Wired article, Google github repo open issue]."},{"type":"text","value":"But despite all this, today the use of the Lenna image is alive and well. Whether it's due to institutional negligence or defiance, it seems that for now, the image is here to stay."},{"type":"text","value":"This raises the question of whether or not digital data like the Lenna image can ever disappear? Once something is on the Internet, is it too late? What power can \"data consent\" hold, when it's so easy for anyone to save data to digital eternity? Surely targeted censorship or invasive data monitoring by governments or corporations aren’t the solution either."},{"type":"text","value":"To me, the crux of the Lenna story is how little power we each have over our data, who collects it, and how it can be used/abused. While our social norms are changing towards personal data, particularly if it is gathered without consent, our digital norms seem harder to change. Advancements in algorithms and storage capabilities are only making data abuse easier."},{"type":"text","value":"Whether the unintended outcome is revenge porn or targeted ads, surveillance or discriminatory model predictions, if we want a world where our data can retire when it's outlived its time, or when it's directly harming our lives, we must build the tools and systems that allow data subjects to have a say in what happens to their own data."},{"type":"text","value":"Here are some possibilities, using the Lenna image as an example:"},{"type":"text","value":"* Identify the image in a software build and exclude its use"},{"type":"text","value":"* Hosting a standard pixelated or distorted version of the image, which can serve as an example or proxy for the actual image but will discourage use of the original"},{"type":"text","value":"* Warning message that pops up whenever the image is uploaded to a storage site like Github or social media site like Twitter"},{"type":"text","value":"* Swap out image uses in text books and class slides with alternative test images"},{"type":"text","value":"* Email bot that messages professors hosting the image on their personal websites and suggests another"}],"post-prose":[],"methods":[]}